src/Enums/уатРазделыПланирования/уатРазделыПланирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>уатРазделыПланирования</name>
  <enumValues>
    <name>ВыработкаТСпоПЛ</name>
    <comment>(не используется) Выработка ТС по путевым листам</comment>
  </enumValues>
  <enumValues>
    <name>ВыработкаТСпоМЛ</name>
    <comment>(не используется) Выработка ТС по маршрутным листам</comment>
  </enumValues>
  <enumValues>
    <name>ПредоставленныеУслуги</name>
    <comment>Предоставленные услуги</comment>
  </enumValues>
  <enumValues>
    <name>Выработка</name>
  </enumValues>
  <enumValues>
    <name>ДоходыРасходы</name>
    <comment>Доходы и Расходы</comment>
  </enumValues>
  <enumValues>
    <name>ОбъемыПеревозок</name>
  </enumValues>
</mdclass:Enum>

src/Enums/уатРазделыПланирования/ManagerModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений();
	ДанныеВыбора.Добавить(Перечисления.уатРазделыПланирования.Выработка);
	ДанныеВыбора.Добавить(Перечисления.уатРазделыПланирования.ПредоставленныеУслуги);
	ДанныеВыбора.Добавить(Перечисления.уатРазделыПланирования.ДоходыРасходы);
	Если ПолучитьФункциональнуюОпцию("уатИспользоватьЗакреплениеМаршрутныхЛистовЗаПеревозчиками_уэ") Тогда
		ДанныеВыбора.Добавить(Перечисления.уатРазделыПланирования.ОбъемыПеревозок);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
